Revit 2024 API
ElectricalLoadAreaData Class
 Represents the electrical load area data.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class ElectricalLoadAreaData : SpatialElementDomainData
Visual Basic
Public Class ElectricalLoadAreaData _
	Inherits SpatialElementDomainData
Visual C++
public ref class ElectricalLoadAreaData : public SpatialElementDomainData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SpatialElementDomainData
 Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData
See Also
ElectricalLoadAreaData Members
Autodesk.Revit.DB.Electrical Namespace